package task02;

public class Ex02 {
//	new는 객체를 생성하며 객체의 참조값을 가져오는 역할을 한다
//	private과 protected는 접근 제한자로
//	private은 같은 클래스 내에서만 사용할 수 있지만 메소드로 getter/setter를
//	만들어주어 다른 클래스에도 이용이 가능하게 할 수 있다
//	protected는 상속관계인 클래스에서만 사용할 수 있다
//	extends는 상속한다는 의미로 부모클래스 자식클래스에서
//	자식클래스가 부모클래스에게 상속받을 때 extends 키워드를 사용한다
//	class는 객체를 생성하기 위한 틀이라 할 수 있다. 객체가 가져야 할 
// 	속성과 동작 등을 정의한다
//	static은 정적인 의미로 스태틱 변수, 스태틱 메소드 등이 있는데 스태틱 변수는
//	클래스에서 동일한 값을 공유하고 스태틱 변수는 객체를 생성하지 않아도 호출 가능하고 
//	주로 공통동작을 구현할 때 사용한다
	
}
